Titanic Challenge
==============

성별과 Pclass를 이용해서 상관관계를 예측하여 제출해 보았다. 결론은 남,녀 두개로 나누어서 commit했을때보다 예측이 잘 되지 않았다.

In [1]:
import numpy as np
import pandas as pd

In [2]:
train = pd.read_csv('C:/Users/sangkyu/git/kaggle/titanic/input/train.csv')
test = pd.read_csv('C:/Users/sangkyu/git/kaggle/titanic/input/test.csv')
print(train.shape)
print(test.shape)

(891, 12)
(418, 11)

In [3]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [4]:
train.groupby('Pclass')[['Survived']].mean()

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [5]:
train.pivot_table(values='Survived',index='Pclass',aggfunc=np.mean)

        Survived
Pclass
1       0.629630
2       0.472826
3       0.242363

In [6]:
train.pivot_table('Survived',['Pclass','Sex'],aggfunc=np.mean)

               Survived
Pclass Sex
1      female  0.968085
       male    0.368852
2      female  0.921053
       male    0.157407
3      female  0.500000
       male    0.135447

성별과 좌석등급에 따라 확인하여본 결과 1등석과 2등석에탄 여자들이 많이 살아남았다는 것을 확인할 수 있었다. 그럼 조건을 2개로 바꾸어 1,2등석에 탄 여자들이 살아남았다고 가정하여 제출해봅니다.

In [12]:
test['Survived'] = (test.Sex =='female')&(test.Pclass == 1)|(test.Pclass == 2)&(test.Age>0)&(test.Embarked)

In [13]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q,False
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,False
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q,True
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S,False
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S,False

In [14]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
Survived         0
dtype: int64

In [15]:
test['Survived'].value_counts()

False    280
True     138
Name: Survived, dtype: int64

In [22]:
submission2 = test[['PassengerId','Survived']].copy()
submission2.head()

   PassengerId  Survived
0          892     False
1          893     False
2          894      True
3          895     False
4          896     False

In [26]:
submission2['Survived']=submission2['Survived'].astype(int)

In [27]:
submission2.to_csv('../titanic/submission2.csv',index = False)

In [28]:
#pwd

'C:\\Users\\sangkyu\\git\\kaggle\\titanic'